In [34]:
import psycopg2
import pandas as pd

In [57]:
employee_df = pd.read_csv('Employee.csv')
employee_df

   Emp_id    Name  Age Gender Department
0       1    Amit   21      M          D
1       2   Pooja   20      F          A
2       3  Kanika   24      F          D
3       4   Rohit   23      M          S
4       5   Naman   22      M          M
5       6   Basak   20      M          M
6       7    Nita   25      F          A

In [67]:
department_df = pd.read_csv('department.csv')
department_df

  Department  Salary   Lead
0          D   78000  Kiran
1          A   56000  Madan
2          D   78000  Kiran
3          S   46000   Nitu
4          M   45000   Nilu
5          M   45000   Nilu
6          A   56000  Madan

In [52]:
def create_database():
    conn = psycopg2.connect("host = 127.0.0.1 dbname= postgres user = postgres password = jojo")
    conn.set_session(autocommit = True)
    cur = conn.cursor()
    
    #create sparkify database with utfb encoding
    cur.execute("drop database if exists accounts1")
    cur.execute("create database accounts1")
    
    #close connection to default db
    conn.close()
    
    #coonnect to sparkify db
    conn = psycopg2.connect("host = 127.0.0.1 dbname = accounts user = postgres password = jojo")
    cur = conn.cursor()
    
    return cur, conn

In [53]:
cur, conn = create_database()

In [54]:
employee_table_create = ("""create table if not exists employee (
Emp_id int Primary Key,
Name varchar,
Age int,
Gender varchar,
Department varchar)""")

In [55]:
cur.execute(employee_table_create)
conn.commit()

In [56]:
department_table_create = ("""create table if not exists department(
Department varchar,
Salary int,
Lead varchar)""")
cur.execute(department_table_create)
conn.commit()

In [59]:
employee_table_insert = ("""insert into employee(
Emp_id,
Name,
Age,
Gender,
Department)
values (%s,%s,%s,%s,%s)
""")

In [60]:
for i, row in employee_df.iterrows():
    cur.execute(employee_table_insert,list(row))

In [61]:
conn.commit()

In [72]:
department_table_insert = ("""insert into department(
Department,
Salary,
Lead)
values (%s,%s,%s)
""")

In [73]:
for i, row in department_df.iterrows():
    cur.execute(department_table_insert,list(row))

In [74]:
conn.commit()